panel/classes/fedex/wsdl/Shipping_SampleTransactions/Delete Shipment.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://fedex.com/ws/ship/v13"><SOAP-ENV:Body><ns1:DeleteShipmentRequest><ns1:WebAuthenticationDetail><ns1:UserCredential><ns1:Key>"Input Your Information"</ns1:Key><ns1:Password>"Input Your Information"</ns1:Password></ns1:UserCredential></ns1:WebAuthenticationDetail><ns1:ClientDetail><ns1:AccountNumber>"Input Your Information"</ns1:AccountNumber><ns1:MeterNumber>"Input Your Information"</ns1:MeterNumber></ns1:ClientDetail><ns1:TransactionDetail><ns1:CustomerTransactionId> *** Cancel Shipment Request v13 ***</ns1:CustomerTransactionId></ns1:TransactionDetail><ns1:Version><ns1:ServiceId>ship</ns1:ServiceId><ns1:Major>13</ns1:Major><ns1:Intermediate>0</ns1:Intermediate><ns1:Minor>0</ns1:Minor></ns1:Version><ns1:ShipTimestamp>2013-07-16T08:03:53+00:00</ns1:ShipTimestamp><ns1:TrackingId><ns1:TrackingIdType>GROUND</ns1:TrackingIdType><ns1:TrackingNumber>794814445475</ns1:TrackingNumber></ns1:TrackingId><ns1:DeletionControl>DELETE_ONE_PACKAGE</ns1:DeletionControl></ns1:DeleteShipmentRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>